using System.Collections;
using UnityEngine;
using UnityEngine.UI;
using TMPro;
   public class testtask : MonoBehaviour 
{
    InputField field; // вставь сюда через инспектор
    public TMP_Text fTema;
    int Tema = 0;
    void Start()
    {
        fTema.text = Tema.ToString();
    }
    public void SomeMethod()
    {
        if (field.text == "45") 
            Tema++;
        
        fTema.text = Tema.ToString(); // Преобразуем int в строку перед присвоением
    }
}

 
//45

// 1)  эмоции сформировались (предложение 1)
// 2)  исследования были систематизированы (предложение 2)
// 3)  учёным был приведён (предложение 3)
// 4)  реакции рассматривал (предложение 4)
// 5)  исследования  — результат (предложение 5)
// (1)Общепринятое положение о единых для человека и животных закономерностях эволюции мозга позволяет считать, что эмоции сформировались задолго до появления человека. (2)Именно с таких позиций рассмотрел эмоции Ч. Дарвин, его исследования были систематизированы в работе «Выражение эмоций у человека и животных». (3)Учёным был приведён большой материал по сравнительному анализу мимики, жестов, голосовых и вегетативных реакций при аффективных состояниях человека и у представителей разных отрядов млекопитающих. (4)Выразительные движения Ч. Дарвин рассматривал как сформировавшиеся в процессе естественного отбора приспособительные реакции, существенные для общения с особями своего или других биологических видов. (5)Именно эти исследования привели Дарвина к убеждению, что многие чувства человека, проявляющиеся в мимике и жестах,  — результат эволюционного процесса.
//12

// 1)  это Мировой океан (предложение 1)
// 2)  разделяют (предложение 2)
// 3)  части есть (предложение 3)
// 4)  выделяют (предложение 4)
// 5)  учёные отказываются признавать (и) обосновывают (предложение 5)
// (1)Самое большое скопление воды на поверхности Земли  — это Мировой океан. (2)Материки и острова разделяют его на отдельные океаны, проливы, заливы. (3)Постоянные морские течения связывают его в единое целое, но у каждой его части есть свои особенности. (4)В Мировом океане обычно выделяют четыре океана: Тихий, Атлантический, Индийский и Северный Ледовитый. (5)На некоторых картах отмечен ещё один океан  — Южный, который омывает Антарктиду, однако многие учёные отказываются признавать его отдельное существование и обосновывают это целой системой научных доказательств.
//45

// 1)  среда постоянно меняется (предложение 1)
// 2)  нарушения вызывают (предложение 2)
// 3)  они способны адаптироваться (предложение 3)
// 4)  понимается приспособление (предложение 4)
// 5)  изменение могло бы погубить (предложение 5)
// (1)Окружающая среда, в которой существуют живые организмы, постоянно меняется. (2)Многие из этих изменений вызывают серьёзные нарушения в работе органов и систем. (3)Но живые организмы способны защищаться от неблагоприятных воздействий и сохранять стабильность внутренней среды благодаря тому, что они способны адаптироваться. (4)Под адаптацией понимается совокупность всех физиологических реакций, обеспечивающих приспособление строения и функций организма или отдельного органа к изменению окружающей среды. (5)Если бы организм не обладал способностью адаптироваться, изменение условий существования могло бы его погубить.
//35

// 1)  мы встречаем (предложение 1)
// 2)  умели вглядываться (предложение 2)
// 3)  пользоваться возможностями (предложение 3)
// 4)  словесное богатство в разнообразии (предложение 4)
// 5)  они существовали (и) были известны (предложение 5)
// (1)Искусное владение несметными сокровищами родного языка мы встречаем у великих русских писателей и поэтов. (2)Они умели чутко вглядываться в слова, находить в них затаённую красоту и силу, дорожить словами и собирать их всю свою жизнь, как самую дорогую коллекцию. (3)Десятки тысяч слов, употреблённых А. С. Пушкиным в его произведениях, безусловно, указывают на огромный круг его представлений и знаний и на его умение мастерски пользоваться безграничными возможностями русского языка. (4)Словесное богатство языка Пушкина заключается в исключительном разнообразии применяемых им слов для выражения мыслей и чувств. (5)Однако словарный запас великого поэта не исчерпывался этим количеством: в его произведениях нет многих слов, хотя они во времена Пушкина существовали и, конечно, были ему известны...
//15

// 1)  один на Земле (предложение 1)
// 2)  существование было бы невозможным (предложение 2)
// 3)  необходимо (предложение 3)
// 4)  есть причина (предложение 4)
// 5)  усложняет исследование (предложение 5)
// (1)Процесс горения  — один из важнейших физико-химических процессов на Земле. (2)Без него существование человека было бы невозможным. (3)Изучение процесса горения необходимо для более эффективного расходования углеводородного топлива и защиты от опустошительных пожаров. (4)Несмотря на важную роль процесса горения в нашей жизни, он изучен явно недостаточно, и для этого есть веская причина  — притяжение Земли, из-за которого при горении возникает движение воздуха: нагретый воздух устремляется вверх, а холодный опускается. (5)Этот поток усложняет исследование процесса горения, поэтому в условиях невесомости изучать горение легче.
//24

// 1)  является отрицание (предложение 1)
// 2)  нельзя согласиться (предложение 2)
// 3)  обобщение (предложение 3)
// 4)  наука не смогла бы развиваться (предложение 4)
// 5)  возможен разгул (предложение 5)
// (1)Одним из признаков лженаучных обобщений является отрицание опыта и теории всей предыдущей науки. (2)На самом деле с этим нельзя согласиться: новое в науке никогда не бывает просто отрицанием старого. (З)Новое  — это лишь существенное изменение, углубление и обобщение старого в связи с новыми сферами исследования. (4)Если бы новая теория начисто отрицала сложившиеся знания, наука вообще не смогла бы развиваться. (5)Без опоры на достижения предшественников любая фантастическая концепция стала бы претендовать на истину, и стал бы возможен полный разгул воображения и чувств учёного.
//24

// 1)  поджигает кучи (предложение 1)
// 2)  осенние ночные заморозки (предложение 2)
// 3)  они (не) укрыты (предложение 3)
// 4)  дым поднимается (и) опускается (предложение 4)
// 5)  он расстилается (предложение 5)
// (1)Зачем садовод осенью при первых ночных заморозках поджигает разложенные по саду кучи влажного мусора? (2)Осенние ночные заморозки  — это налетающий с севера холодный воздух и открытое небо. (3)Земля теряет накопленное за день тепло в результате конвекции и теплового инфракрасного излучения, и корни деревьев могут промёрзнуть, пока они не укрыты снегом. (4)Дым от костров поднимается невысоко и не сразу опускается на землю. (5)Он расстилается над садом, образуя некое «одеяло», которое препятствует конвекции воздуха и отражает инфракрасное излучение земли над всей площадью сада.
//345

// 1)  медведь обитает по России (предложение 1)
// 2)  что способствует (предложение 2)
// 3)  шерстинки полые (предложение 3)
// 4)  дробит свет (предложение 4)
// 5)  мех может желтеть (предложение 5)
// (1)Бурый медведь обитает по всей лесной зоне, кроме юга Европейской части России, и местами в лесотундре. (2)Кожа у него тёмная, почти чёрного цвета, что способствует наименьшей теплоотдаче. (3)А мех полярных медведей выглядит белым, он лишён пигментной окраски, и шерстинки полые. (4)Медведь выглядит белым, потому что неровная внутренняя поверхность трубочек меха дробит свет и отражает его под различными углами, что и создаёт видимость белого цвета. (5)Летом мех может желтеть из-за постоянного воздействия солнечного света.
//235

// 1)  звуки  — (это) то (предложение 1)
// 2)  мы слышим (предложение 2)
// 3)  звучат машины, транспорт (предложение 3)
// 4)  называется «акустика» (предложение 4)
// 5)  применяют приборы (предложение 5)
// (1)3вуки  —это то, что слышит ухо. (2)Мы слышим голоса людей, пение птиц, звуки музыкальных инструментов, шум леса в ветреную погоду, плеск морских волн, гром во время грозы. (З)Звучат работающие машины, движущийся транспорт. (4)Раздел физики, в котором изучаются звуковые явления, называется «акустика» (слово «акустика» образовано от греческого слова akustikos  —«звуковой»). (5)При изучении звуковых явлений в качестве источника звука применяют специальные приборы, например камертон.
//123

